Hi folks 👋 This issue is resolved in Terraform 0.12, which supports new functionality in the configuration language aimed at solving this issue. The new [`dynamic` block syntax](https://www.terraform.io/docs/configuration/expressions.html#dynamic-blocks) can be used to dynamically generate configuration blocks and their arguments. These can be combined with the new [`null` value](https://www.terraform.io/docs/configuration/expressions.html#null), which can be used to omit arguments as if they were not defined in the configuration at all.

Given this configuration:

```hcl
terraform {
  required_providers {
    aws = "2.20.0"
  }
  required_version = "0.12.5"
}

provider "aws" {
  region = "us-east-1"
}

variable "test1" {
  type = list(object({
    instance_port      = number
    instance_protocol  = string
    lb_port            = number
    lb_protocol        = string
    ssl_certificate_id = string
  }))
  default = [{
    instance_port      = 3306
    instance_protocol  = "tcp"
    lb_port            = 3306
    lb_protocol        = "tcp"
    ssl_certificate_id = null
  }]
}

variable "test2" {
  type = list(object({
    instance_port      = number
    instance_protocol  = string
    lb_port            = number
    lb_protocol        = string
    ssl_certificate_id = string
  }))
  default = [
    {
      instance_port      = 3306
      instance_protocol  = "tcp"
      lb_port            = 3306
      lb_protocol        = "tcp"
      ssl_certificate_id = null
    },
    {
      instance_port      = 3307
      instance_protocol  = "tcp"
      lb_port            = 3307
      lb_protocol        = "tcp"
      ssl_certificate_id = null
    },
  ]
}

data "aws_availability_zones" "available" {
  state = "available"
}

resource "aws_elb" "test1" {
  availability_zones = ["${data.aws_availability_zones.available.names[0]}", "${data.aws_availability_zones.available.names[1]}", "${data.aws_availability_zones.available.names[2]}"]

  dynamic "listener" {
    for_each = var.test1

    content {
      instance_port      = listener.value.instance_port
      instance_protocol  = listener.value.instance_protocol
      lb_port            = listener.value.lb_port
      lb_protocol        = listener.value.lb_protocol
      ssl_certificate_id = listener.value.ssl_certificate_id
    }
  }
}

resource "aws_elb" "test2" {
  availability_zones = ["${data.aws_availability_zones.available.names[0]}", "${data.aws_availability_zones.available.names[1]}", "${data.aws_availability_zones.available.names[2]}"]

  dynamic "listener" {
    for_each = var.test2

    content {
      instance_port      = listener.value.instance_port
      instance_protocol  = listener.value.instance_protocol
      lb_port            = listener.value.lb_port
      lb_protocol        = listener.value.lb_protocol
      ssl_certificate_id = listener.value.ssl_certificate_id
    }
  }
}
```

Produces the following apply output:

```
$ terraform apply
data.aws_availability_zones.available: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elb.test1 will be created
  + resource "aws_elb" "test1" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "us-east-1a",
          + "us-east-1b",
          + "us-east-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + target              = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + listener {
          + instance_port     = 3306
          + instance_protocol = "tcp"
          + lb_port           = 3306
          + lb_protocol       = "tcp"
        }
    }

  # aws_elb.test2 will be created
  + resource "aws_elb" "test2" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "us-east-1a",
          + "us-east-1b",
          + "us-east-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + target              = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + listener {
          + instance_port     = 3306
          + instance_protocol = "tcp"
          + lb_port           = 3306
          + lb_protocol       = "tcp"
        }
      + listener {
          + instance_port     = 3307
          + instance_protocol = "tcp"
          + lb_port           = 3307
          + lb_protocol       = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_elb.test1: Creating...
aws_elb.test2: Creating...
aws_elb.test1: Creation complete after 2s [id=tf-lb-20190724060547739800000001]
aws_elb.test2: Creation complete after 2s [id=tf-lb-20190724060547741000000002]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

Enjoy! 🚀 